Revit 2027 API
FabricSheet.SketchId Property
 The id of the Sketch element for this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SketchId { get; }
Public ReadOnly Property SketchId As ElementId
	Get
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
member SketchId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace